print("Упражнение 9-1")

# Ресторан: создайте класс с именем Restaurant Метод __init__() класса Restaurant должен содержать два атрибута:
# restaurant_name и cuisine_type 
# Создайте метод describe_restaurant(), который выводит два атрибута, и метод open_restaurant(), 
# который выводит сообщение о том, что ресторан открыт.
# Создайте на основе своего класса экземпляр с именем restaurant.
# Выведите два атрибута по отдельности, затем вызовите оба метода.
# задача выполнена в файле restaurant.py

print("\nУпражнение 9-2")

# Три ресторана: начните с класса из упражнения 9-1 Создайте три разных экземпляра,
# вызовите для каждого экземпляра метод describe_restaurant()

print("\nУпражнение 9-3")

# Пользователи: создайте класс с именем User Создайте два атрибута first_name и last_name,
# а затем еще несколько атрибутов, которые обычно хранятся в профиле пользователя. 
# Напишите метод describe_user(), который выводит сводку с информацией о пользователе.
# Создайте еще один метод greet_user() для вывода персонального приветствия для пользователя.
# Создайте несколько экземпляров, представляющих разных пользователей.
# Вызовите оба метода для каждого пользователя.
# задача выполнена в файле new_user.py

print("\nУпражнение 9-4")

# Начните с программы из упражнения 9-1 (с 165) - Добавьте атрибут number_served со значением по умолчанию 0;
# он представляет количество обслуженных посетителей.
# Создайте экземпляр с именем restaurant. 
# Выведите значение number_served, потом измените и выведите снова.
# Добавьте метод с именем set_number_served(), позволяющий задать количество обслуженных посетителей. 
# Вызовите метод с новым числом, снова выведите значение.
# Добавьте метод с именем increment_number_served(), который увеличивает количество обслуженных посетителей на заданную величину. 
# Вызовите этот метод с любым числом, которое могло бы представлять количество обслуженных клиентов за один день.
# задача выполнена в файле new_restaurant.py

print("\nУпражнение 9-5")

# добавьте атрибут login_attempts в класс User из упражнения 9-3(с 165).
# Напишите метод increment_login_attempts(), увеличивающий значение login_attempts на 1. 
# Напишите другой метод с именем reset_login_attempts(), обнуляющий значение login_attempts.
# Создайте экземпляр класса User и вызовите increment_login_attempts() несколько раз. 
# Выведите значение login_attempts, чтобы убедиться в том, что значение было изменено правильно,
# а затем вызовите reset_login_attempts() Снова выведите login_attempts и убедитесь в том, что значение обнулилось.
# задача выполнена в файле new_user_2.py