print("Упражнение 9-1")

# Ресторан: создайте класс с именем Restaurant Метод __init__() класса Restaurant должен содержать два атрибута:
# restaurant_name и cuisine_type 
# Создайте метод describe_restaurant(), который выводит два атрибута, и метод open_restaurant(), 
# который выводит сообщение о том, что ресторан открыт.
# Создайте на основе своего класса экземпляр с именем restaurant.
# Выведите два атрибута по отдельности, затем вызовите оба метода.
# задача выполнена в файле restaurant.py
print("\nУпражнение 9-2")

# Три ресторана: начните с класса из упражнения 9-1 Создайте три разных экземпляра,
# вызовите для каждого экземпляра метод describe_restaurant()

print("\nУпражнение 9-3")
# Пользователи: создайте класс с именем User Создайте два атрибута first_name и last_name,
# а затем еще несколько атрибутов, которые обычно хранятся в профиле пользователя. 
# Напишите метод describe_user(), который выводит сводку с информацией о пользователе.
# Создайте еще один метод greet_user() для вывода персонального приветствия для пользователя.
# Создайте несколько экземпляров, представляющих разных пользователей.
# Вызовите оба метода для каждого пользователя.
# задача выполнена в файле new_user.py