print('Упражнение 10-1\n')

# Откройте пустой файл в текстовом редакторе и напишите несколько строк текста о возможностях Python.
# Каждая строка должна начинаться с фразы: «In Python you can…».
# Сохраните файл под именем learning_python txt в каталоге, использованном для примеров этой главы.
# Напишите программу, которая читает файл и выводит текст три раза:
# с чтением всего файла, с перебором строк объекта файла и с сохранением строк в списке
# с последующим выводом списка вне блока with
# задача выполнена в hokku_reader.py

print('Упражнение 10-2\n')

# Изучение C: метод replace() может использоваться для замены любого слова в строке
# другим словом В следующем примере слово ‘dog’ заменяется словом ‘cat’:
# >>> message = "I really like dogs."
# >>> message.replace('dog', 'cat')
# 'I really like cats.'
# Прочитайте каждую строку из только что созданного файла learning_python txt и замените
# слово Python названием другого языка, например C Выведите каждую измененную строку на экран
# задача выполнена в replace_words.py

print('Упражнение 10-3\n')

# Гость: напишите программу, которая запрашивает у пользователя его имя
# Введенный ответ сохраняется в файле с именем guest.txt
# задача выполнена в файле guest.py

print('Упражнение 10-4\n')

# Гостевая книга: напишите цикл while, который в цикле запрашивает у пользователей имена
# При вводе каждого имени выведите на экран приветствие и добавьте строку с сообщением в файл с именем guest_book.txt
# Проследите за тем, чтобы каждое сообщение размещалось в отдельной строке файла